---
kind: other
id: Methods.T:Autodesk.Revit.DB.Macros.MacroManager
source: html/7925dcf2-a59f-9e1c-e173-176ef4dc3913.htm
---
# MacroManager Methods

Adds a MacroModule to the application or document.